Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33f/h/p33FJ64MC710.h
#define _AD1CON4_DMABL2_POSITION                 0x00000002
#define _AD1CON4_DMABL2_MASK                     0x00000004
#define _AD1CON4_DMABL2_LENGTH                   0x00000001

#define _AD2CON1_DONE_POSITION                   0x00000000
#define _AD2CON1_DONE_MASK                       0x00000001
#define _AD2CON1_DONE_LENGTH                     0x00000001

#define _AD2CON1_SAMP_POSITION                   0x00000001
#define _AD2CON1_SAMP_MASK                       0x00000002
#define _AD2CON1_SAMP_LENGTH                     0x00000001

#define _AD2CON1_ASAM_POSITION                   0x00000002
#define _AD2CON1_ASAM_MASK                       0x00000004
#define _AD2CON1_ASAM_LENGTH                     0x00000001

#define _AD2CON1_SIMSAM_POSITION                 0x00000003
#define _AD2CON1_SIMSAM_MASK                     0x00000008
#define _AD2CON1_SIMSAM_LENGTH                   0x00000001

#define _AD2CON1_SSRC_POSITION                   0x00000005
#define _AD2CON1_SSRC_MASK                       0x000000E0
#define _AD2CON1_SSRC_LENGTH                     0x00000003

#define _AD2CON1_FORM_POSITION                   0x00000008
#define _AD2CON1_FORM_MASK                       0x00000300
#define _AD2CON1_FORM_LENGTH                     0x00000002

#define _AD2CON1_AD12B_POSITION                  0x0000000A
#define _AD2CON1_AD12B_MASK                      0x00000400
#define _AD2CON1_AD12B_LENGTH                    0x00000001

#define _AD2CON1_ADDMABM_POSITION                0x0000000C
#define _AD2CON1_ADDMABM_MASK                    0x00001000
#define _AD2CON1_ADDMABM_LENGTH                  0x00000001

#define _AD2CON1_ADSIDL_POSITION                 0x0000000D
#define _AD2CON1_ADSIDL_MASK                     0x00002000
#define _AD2CON1_ADSIDL_LENGTH                   0x00000001

#define _AD2CON1_ADON_POSITION                   0x0000000F
#define _AD2CON1_ADON_MASK                       0x00008000
#define _AD2CON1_ADON_LENGTH                     0x00000001

#define _AD2CON1_SSRC0_POSITION                  0x00000005
#define _AD2CON1_SSRC0_MASK                      0x00000020
#define _AD2CON1_SSRC0_LENGTH                    0x00000001

#define _AD2CON1_SSRC1_POSITION                  0x00000006
#define _AD2CON1_SSRC1_MASK                      0x00000040
#define _AD2CON1_SSRC1_LENGTH                    0x00000001

#define _AD2CON1_SSRC2_POSITION                  0x00000007
#define _AD2CON1_SSRC2_MASK                      0x00000080
#define _AD2CON1_SSRC2_LENGTH                    0x00000001

#define _AD2CON1_FORM0_POSITION                  0x00000008
#define _AD2CON1_FORM0_MASK                      0x00000100
#define _AD2CON1_FORM0_LENGTH                    0x00000001

#define _AD2CON1_FORM1_POSITION                  0x00000009
#define _AD2CON1_FORM1_MASK                      0x00000200
#define _AD2CON1_FORM1_LENGTH                    0x00000001

#define _AD2CON2_ALTS_POSITION                   0x00000000
#define _AD2CON2_ALTS_MASK                       0x00000001
#define _AD2CON2_ALTS_LENGTH                     0x00000001

#define _AD2CON2_BUFM_POSITION                   0x00000001
#define _AD2CON2_BUFM_MASK                       0x00000002
#define _AD2CON2_BUFM_LENGTH                     0x00000001

#define _AD2CON2_SMPI_POSITION                   0x00000002
#define _AD2CON2_SMPI_MASK                       0x0000003C
#define _AD2CON2_SMPI_LENGTH                     0x00000004

#define _AD2CON2_BUFS_POSITION                   0x00000007
#define _AD2CON2_BUFS_MASK                       0x00000080
#define _AD2CON2_BUFS_LENGTH                     0x00000001

#define _AD2CON2_CHPS_POSITION                   0x00000008
#define _AD2CON2_CHPS_MASK                       0x00000300
#define _AD2CON2_CHPS_LENGTH                     0x00000002

#define _AD2CON2_CSCNA_POSITION                  0x0000000A
#define _AD2CON2_CSCNA_MASK                      0x00000400
#define _AD2CON2_CSCNA_LENGTH                    0x00000001

#define _AD2CON2_VCFG_POSITION                   0x0000000D
#define _AD2CON2_VCFG_MASK                       0x0000E000
#define _AD2CON2_VCFG_LENGTH                     0x00000003

#define _AD2CON2_SMPI0_POSITION                  0x00000002
#define _AD2CON2_SMPI0_MASK                      0x00000004
#define _AD2CON2_SMPI0_LENGTH                    0x00000001

#define _AD2CON2_SMPI1_POSITION                  0x00000003
#define _AD2CON2_SMPI1_MASK                      0x00000008
#define _AD2CON2_SMPI1_LENGTH                    0x00000001

#define _AD2CON2_SMPI2_POSITION                  0x00000004
#define _AD2CON2_SMPI2_MASK                      0x00000010
#define _AD2CON2_SMPI2_LENGTH                    0x00000001

#define _AD2CON2_SMPI3_POSITION                  0x00000005
#define _AD2CON2_SMPI3_MASK                      0x00000020
#define _AD2CON2_SMPI3_LENGTH                    0x00000001

#define _AD2CON2_CHPS0_POSITION                  0x00000008
#define _AD2CON2_CHPS0_MASK                      0x00000100
#define _AD2CON2_CHPS0_LENGTH                    0x00000001

#define _AD2CON2_CHPS1_POSITION                  0x00000009
#define _AD2CON2_CHPS1_MASK                      0x00000200
#define _AD2CON2_CHPS1_LENGTH                    0x00000001

#define _AD2CON2_VCFG0_POSITION                  0x0000000D
#define _AD2CON2_VCFG0_MASK                      0x00002000
#define _AD2CON2_VCFG0_LENGTH                    0x00000001

#define _AD2CON2_VCFG1_POSITION                  0x0000000E
#define _AD2CON2_VCFG1_MASK                      0x00004000
#define _AD2CON2_VCFG1_LENGTH                    0x00000001

#define _AD2CON2_VCFG2_POSITION                  0x0000000F
#define _AD2CON2_VCFG2_MASK                      0x00008000
#define _AD2CON2_VCFG2_LENGTH                    0x00000001

#define _AD2CON3_ADCS_POSITION                   0x00000000
#define _AD2CON3_ADCS_MASK                       0x000000FF
#define _AD2CON3_ADCS_LENGTH                     0x00000008

#define _AD2CON3_SAMC_POSITION                   0x00000008
#define _AD2CON3_SAMC_MASK                       0x00001F00
#define _AD2CON3_SAMC_LENGTH                     0x00000005

